lumberjack-automate/docs/outline.tex
% Created 2023-07-07 Fri 12:55
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{listings}
\usepackage{xcolor}
\input{../presentations/lstynix.tex}
\author{Rory Tyler Hayford}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Rory Tyler Hayford},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\setcounter{tocdepth}{3}
\tableofcontents

This outlines possible approaches (and related difficulties) for a system that allows users to automate lumberjack configuration, focusing specifically on installing and configuring driver packages for the lumberjack. Note that this does not cover other considerations such as frontend components or other configuration features for lumberjack systems. The outline refers to several basic components of the system. These are described in more detail below, but can be basically defined as:
\begin{description}
\item[{Configuration framework}] The component responsible for generating configuration scripts from user-defined configurations and interacting with our existing build system
\item[{Service component}] The component responsible for providing user-defined configurations to the configuration framework, handling and executing the resulting configuration scripts, and communicating with other processes, etc\ldots{}
\item[{Configuration scripts}] The scripts that are generated by the configuration framework and perform the real-world effects necessary to install and configure drivers for a lumberjack
\end{description}
\section*{Configuration framework}
\label{sec:org857922d}
Because we already use Nix as the basis for our build system, it will probably be easiest to interface with it directly by using Nix for the automation system. We could also use existing Haskell libraries to generate Nix expressions from the user-specified configuration. This introduces its own significant challenges to solve, however:
\begin{itemize}
\item We will need a way to connect a build-time configuration system with dynamic, user-specified configuration. This applies to Nix, but even if we were to use a different language or tool for configuration framework, we would likely still have this problem and would have the additional problem of a more awkward and fragile interface with our existing build system
\item Because the complete configuration will need to use the results of impure process execution as inputs to subsequent steps, we will mostly likely need to split the configuration framework into smaller, modular pieces
\end{itemize}
\subsection*{Module system}
\label{sec:org744e859}
The automation system will require dependencies between different options: configuring one option may depend on the results of different configuration options (computed either purely or impurely as may be the case). If we use Nix as a configuration system, the most obvious approach for solving the problem of mutual dependencies is to use the module system:
\begin{itemize}
\item We will have a large number of options with possibly recursive dependencies between them. This sort of problem is what the Nix module system is designed to solve
\item We mostly likely want a method of verifying that options and configurations conform to some sort of schema, without limiting the complexity of the schema in order to facilitate verification (that is, we don't want to design a less powerful or flexible system merely to be able to verify it more easily). Attempting to do this outside of the module system would increase the ultimate complexity and fragility of the automation system
\end{itemize}
\subsubsection*{Configuration options}
\label{sec:orgd526374}
We will need to support several drivers (perhaps one dozen). Because all of these are configured using different processes and different serialized representations, we will need to write individual module configuration options for each. We will most likely also need to create different individual modules for each driver, to represent different stages of configuration. This does not mean the module system is impractical as a configuration framework, however. It would be easier to use the module system for this, in fact, because we can reuse and extend modules between different driver module options.

The Nix module system also simplifies the process of declaring dependencies between different options, which is preferable to an ad-hoc approach to managing option dependencies.
\subsection*{Dynamic results}
\label{sec:org0b44a01}
We will most likely need to depend on dynamic results from external processes requiring network or database connections (e.g. submitting an add or update request to \texttt{single-well-controllogix}). Because a user may configure one service, which then performs a real-world effect and returns a result (e.g. a PID), this almost certainly cannot be accomplished within a single module evaluation because it cannot be executed in a Nix build sandbox. Because of the complexity and depth of the side effects required by configurations, we cannot have a single ``configuration''. Instead, we can expose a series of configurations that each evaluate to their own configuration scripts. There are two possible approaches to this:
\subsubsection*{Series of scripts}
\label{sec:org7981a44}
In this approach, the configuration framework wouldn't create a single configuration script in a single pass. Instead, several script-generating modules for each driver would be exposed. The service component would pass the user-defined configuration to the configuration framework to generate the initial scripts. The scripts would be executed, and the evaluation results would then be passed to a \emph{separate} module; the results of the impure, real-world script execution would be represented in the module options of the next phase of the configuration framework. For example:
\lstset{language=nix,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
# The service component will evaluate this module first.
# It will produce a script that the service component
# will then execute. The result will be passed to the next
# module
{
  options.pureValue = { /*...*/ };
  config.getPidScript = pkgs.writeShellApplication {
    # This command may return a PID, for example
    text = ''
      get-pid-with-pure-value ${options.pureValue}
    '';
  };
}

# The service component will then evaluate this using
# the result of the previous step, and then create a
# *new* Nix expression to evaluate
{
  # This value was obtained impurely, but the configuration
  # system doesn't know that. The evaluation of this module
  # and the first one are separate
  options.thePid = { /*...*/ };
  config.doMoreScript = pkgs.writeShellApplication {
    text = ''
      do-something-else-with-pid ${options.thePid}
    '';
  };
}
\end{lstlisting}
