lumberjack-automate/docs/outline.tex
\subsubsection*{Defer side effects}
\label{sec:orgfd4fa41}
Instead of producing a series of scripts as part of a pipeline, we could generate all of the configuration for a single driver in a single pass. The configuration framework would generate a series of scripts for the given driver in a single evaluation. These scripts would take standard command-line arguments. The service component would execute the scripts in sequence and would supply the command-line arguments as needed. In this case, only the initial \emph{pure} user-defined configuration options would be handled by the configuration framework, which would be used to generate the series of side-effecting scripts. For example:
\lstset{language=nix,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
# All of the Nix modules will be evaluated in a single
# pass. There will be no way of representing the values
# obtained impurely as part of the module system. Only
# the initial pure values are representable
{
  options.pureValue = { /*...*/ };
  config.getPidScript = pkgs.writeShellApplication {
    text = ''
      get-pid-with-pure-value ${options.pureValue}
    '';
  };
  config.doMoreScript = pkgs.writeShellApplication {
    # Because this is decoupled from the Nix evaluation,
    # it will be the service component's responsibility to
    # handle command-line arguments when executing the
    # scripts (for example, it needs to know that the
    # argument to this script is the result of the
    # previous script)
    text = ''
      do-something-else-with-pid $1
    '';
  };
}
\end{lstlisting}
Even though we can't represent \emph{all} possible inputs using this approach, we would still be able to use as many pure values as possible, even at later stages. For example, in the \texttt{config.doMoreScript} above, we could still reference pure values when generating the script.
\section*{Configuration scripts}
\label{sec:org4aa7ff8}
\subsection*{Format}
\label{sec:org03ceece}
Previous sections have referred to configuration scripts without defining the structure or format of these scripts. Two possible choices are:
\subsubsection*{Bash scripts}
\label{sec:orgdeee866}
The most flexible approach would be to generate bash scripts that would be executed by the service component. We would largely lose the ability to maintain a structure or schema the configuration scripts, and the configuration framework would have to take a more imperative approach. If we choose to defer side effects to the latest possible point, as described above, we would mostly likely need to use this approach in order to pass execution results as a series of command-line arguments.
\subsubsection*{Systemd units}
\label{sec:org0cb0f46}
Systemd units would provide a more declarative and structured approach. There are existing Nix tools that simplify creating systemd units, and we would more easily be able to test and lint the internal Nix code. Systemd units themselves can be generated using the Nix module system, which would help prevent the creation of invalid scripts. We would lose the flexibility of bash scripts, however.
\subsection*{Phases}
\label{sec:orgf7b940e}
The scripts would need to be split into two broad sets or phases, installation and configuration:
\subsubsection*{Package installation}
\label{sec:org898615b}
The first step in the automation system is to install the packages themselves. The first phase in the generated configuration scripts will accomplish this, mediated by the service component.

Assuming we have a ``fresh'' lumberjack and wish to install several driver packages on it, we will need to consider how the initial installation should be performed. Integrating the automation system with LAS is crucial to allow users to upgrade or remove packages that were installed via the automation system (of course, this applies to any operations we want to perform later via \texttt{mass-deploy} as well).

Presumably, we will want to use the existing LAS infrastructure (i.e. communicate with \texttt{lumberjack-deployment-server} to install the packages). This may require more up-front complexity in terms of connecting the two systems, but would would most likely result in less work compared to attempting to install packages in some other fashion (e.g. generating scripts that call \texttt{lumberjack-installer} directly and transmitting them to the lumberjack).
\subsubsection*{Package configuration}
\label{sec:org2fbc59f}
Once the installation of the package(s) is complete, the service component can execute scripts to configure each driver, as described in more detail above. Once the script is generated, the service component will be responsible for executing it and manipulating the results.
\section*{Service component}
\label{sec:org098f5b2}
Regardless of the configuration framework we develop, we will need some sort of additional service that can process user-defined configurations and interface with the configuration framework. This service will have several important tasks:
\subsubsection*{Communicating with lumberjacks and other services}
\label{sec:orgfb005a1}
Because we will need to configure drivers that live on lumberjacks, the service component will need to be able to communicate with the given lumberjack and the services running on it. It would be best to reuse existing OnPing routes to accomplish this, rather than attempting to reimplement it. In addition, the service component will need to communicate with other services, e.g. LAS.
\subsubsection*{Processing user configurations}
\label{sec:orgd13d295}
The service will need to translate user configurations (in whatever user-facing format we eventually choose) to the format of the configuration system (assumed to be Nix expressions). If the user interface is a series of forms or other inputs, this would be relatively straightforward. The frontend can post form data or JSON to the service. The structured data can be converted to Nix and the configuration scripts can be generated. If we provide a more dynamic option for user input, for example an Inferno script, this step would become significantly more difficult and may require extending Inferno itself.

The easiest interface, at least initially, would match the struture of the configuration framework exactly. For example, given configuration options for \texttt{single-well-controllogix}, we would provide a series of inputs closely matching the structure of the module options. Using the Nix module system will simplify this (for example, we may be able to automatically generate schema from the module declarations).
\subsubsection*{Storing execution results}
\label{sec:org19614a4}
The service component will need to use execution results from one configuration as inputs to another. Depending on the complexity involved, we could consider: simply using output redirection, i.e. capturing the output of one process to use as an input to the next; or using a database such as SQLite if we will need to use the same results in multiple places, or retrieve them at different stages in the execution pipeline
\subsubsection*{Connecting build-time configuration with dynamic input}
\label{sec:org1b0347f}
This step is more complex and difficult to implement. Essentially, we need to bridge the user-defined configuration and the configuration framework, i.e. parameterize the build with runtime information. Of course, we can't use the typical approach of evaluating and building Nix ahead of time as the majority of possible inputs (i.e. inputs corresponding to module options) are unknown. Also, as mentioned above, there may be significant external processes required that would prevent us from building a single, comprehensive configuration script at once.
\begin{itemize}
\item Using a repo
\label{sec:org85a9dc7}
