lumberjack-automate/docs/outline.org
**** Using a repo

This is something of a hack, but is an established approach in the post-flakes Nix world:
- A new repo would be created to house the module definitions defined in their own flake
- It would have two or more inputs: ~all~ (in order to have access to our normal build artifacts) and a ~source~ input or series of inputs
- The only artifacts exposed by the flake would be a series of packages; each package would be an applied function taking the ~source~ as the argument. The function evaluates the Nix expression using the modules of the configuration framework described above. for example:
  #+begin_src nix
  {
    packages = {
     # This is an applied function,
     # `buildDriver1Configuration` is
     # a function taking a configuration
     # and evaluating the modules
     driver1 = buildDriver1Configuration
       inputs.driver1-config-source;
    };
    # ...
  }
  #+end_src
- The source input would be set by default to a Nix expression (e.g. a local path) representing a no-op
- When overridden, the ~source~ input or inputs act(s) as a parameter to the function
- After translating the user-defined configurations to Nix expressions, the service component would save it to a file. It would then build the configuration by overriding the ~source~ input:
  #+begin_src
  nix build .#driver1Config \\
    --override-input driver1-config-source \\
    ./path/to/driver1/config
  #+end_src
**** Runtime interfacing with =all=

- Module definitions could live in ~all~ or another repo
- Nix functions would be exposed that take Nix expressions (or filepaths pointing to Nix expressions) as arguments, which are then evaluated by the configuration framework
- Because this is necessarily impure, we could not use the standard flake interface to interact with the module definitions
- Instead, ~builtins.getFlake~ could be used with ~nix eval --impure --expr~
- The service component would translate user-defined configuration into compatible Nix expressions, call ~nix eval~ with ~builtins.getFlake~, and then execute the resulting configuration scripts
*** Other requirements
Because we will need to interface with either ~all~ directly or indirectly (if we use an auxiliary repo as described above), the service component will need to run on a machine with:
- Access to ~all~ (or the auxiliary repo). This is not a problem in practice as we can use flakes remotely, e.g. ~nix build git+ssh://...~, provided that SSH is configured correctly
- Access to our Nix binary cache
