lumberjack-automate/docs/outline.tex

This is something of a hack, but is an established approach in the post-flakes Nix world:
\begin{itemize}
\item A new repo would be created to house the module definitions defined in their own flake
\item It would have two or more inputs: \texttt{all} (in order to have access to our normal build artifacts) and a \texttt{source} input or series of inputs
\item The only artifacts exposed by the flake would be a series of packages; each package would be an applied function taking the \texttt{source} as the argument. The function evaluates the Nix expression using the modules of the configuration framework described above. for example:
\lstset{language=nix,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
  {
    packages = {
     # This is an applied function,
     # `buildDriver1Configuration` is
     # a function taking a configuration
     # and evaluating the modules
     driver1 = buildDriver1Configuration
       inputs.driver1-config-source;
    };
    # ...
  }
\end{lstlisting}
\item The source input would be set by default to a Nix expression (e.g. a local path) representing a no-op
\item When overridden, the \texttt{source} input or inputs act(s) as a parameter to the function
\item After translating the user-defined configurations to Nix expressions, the service component would save it to a file. It would then build the configuration by overriding the \texttt{source} input:
\begin{verbatim}
  nix build .#driver1Config \\
    --override-input driver1-config-source \\
    ./path/to/driver1/config
\end{verbatim}
\end{itemize}
\item Runtime interfacing with \texttt{all}
\label{sec:org4d067c0}

\begin{itemize}
\item Module definitions could live in \texttt{all} or another repo
\item Nix functions would be exposed that take Nix expressions (or filepaths pointing to Nix expressions) as arguments, which are then evaluated by the configuration framework
\item Because this is necessarily impure, we could not use the standard flake interface to interact with the module definitions
\item Instead, \texttt{builtins.getFlake} could be used with \texttt{nix eval -{}-impure -{}-expr}
\item The service component would translate user-defined configuration into compatible Nix expressions, call \texttt{nix eval} with \texttt{builtins.getFlake}, and then execute the resulting configuration scripts
\end{itemize}
\end{itemize}
\subsubsection*{Other requirements}
\label{sec:org968c8a4}
Because we will need to interface with either \texttt{all} directly or indirectly (if we use an auxiliary repo as described above), the service component will need to run on a machine with:
\begin{itemize}
\item Access to \texttt{all} (or the auxiliary repo). This is not a problem in practice as we can use flakes remotely, e.g. \texttt{nix build git+ssh://...}, provided that SSH is configured correctly
\item Access to our Nix binary cache
\end{itemize}
\end{document}
